#+TITLE: NixOS Tests
#+AUTHOR: Quentin
#+DATE: <2021-01-14 Thu>


* Introduction

You can find the Doc on NixOS tests at: https://nixos.org/manual/nixos/stable/index.html#sec-nixos-tests

The idea of NixOS tests is to have an automatic testing framework for
NixOS.
It uses [[https://www.qemu.org][QEMU]] to start one or several virtual NixOS machines for the
test.

There are two steps to write a NixOS test:

1. Write the NixOS configuration(s) of the machine(s)
   
2. Write the tests to run once the machine(s) ha(s|ve) booted

The tests part must be written in Python.

A example of test file, taken from the documentation:

#+BEGIN_EXAMPLE nix
import ./make-test-python.nix {

  # Either the configuration of a single machine:
  machine =
    { config, pkgs, ... }:
    { configuration…
    };

  # Or a set of machines:
  nodes =
    { machine1 =
        { config, pkgs, ... }: { … };
      machine2 =
        { config, pkgs, ... }: { … };
      …
    };

  testScript =
    ''
      Python code…
    '';
}
#+END_EXAMPLE

There are a lot of configuration for the VMs, and a decent API to run
tests.

To run the test, simply build the nix file.

One advantage of this approach is the speed to run the tests.
Indeed, the creation and launching of VMs is extremely fast.
It will mount the store, and thus, no image are needed.
But you must pay attention of what you want to test.
Having 4 or 5 VMs running on your personnal laptop might be a bit much
for your RAM ...
* Passing Tests
** Introduction
In the remaining of this document, we will setup a NixOS for a simple
example.

We would like to run a test to verify that the (famous) hello package
works.

The idea is the following: boot a VM with hello installed, run hello,
compare output to the expected one.

** test.nix

First, let's write the test file (test.nix).
We will give it a name.
We define a machine with a given configuration (that we will look at
later).
And finally we look at the test script.
Nothing fancy, we start the machine, wait for it to finish booting,
then execture the hello application and get back the stdout.
To check if the test passed, we compare the output of stdout with what
we expect: "Hello, world!".
#+NAME: test_passing
#+BEGIN_EXAMPLE nix
{ ... }:

{
  name = "minimal_test";
  skipLint = true;

  nodes.server = ./server.nix;

  testScript = ''
    start_all()
    server.wait_for_unit("multi-user.target")
    (status, output) = server.execute("hello")
    assert("Hello, world!\n" == output)
  '';
}
#+END_EXAMPLE

#+BEGIN_SRC sh :var test_content=test_passing :exports none
echo "$test_content" > test.nix
#+END_SRC

#+RESULTS:

** server.nix

The configuration of the machine is farely simple in this example.
We just want the hello package...

#+NAME: server
#+BEGIN_EXAMPLE nix
{ pkgs, ... }: 

{
   environment.systemPackages = with pkgs; [
     hello
   ];
}
#+END_EXAMPLE

#+BEGIN_SRC sh :var server_content=server :exports none
echo "$server_content" > server.nix
#+END_SRC

#+RESULTS:

** default.nix

In the default.nix file, we simply need to tell Nix to run the tests.

#+NAME: default
#+BEGIN_EXAMPLE nix
{ pkgs ? import <nixpkgs> {} }: {
  test = pkgs.nixosTest ./test.nix;
}
#+END_EXAMPLE

#+BEGIN_SRC sh :var default_content=default :exports none
echo "$default_content" > default.nix
#+END_SRC

#+RESULTS:

** Running the tests

To run the tests, we just need to build default.nix

#+BEGIN_SRC sh :exports both :results verbatim
nix-build default.nix 2>&1 > passing.log
cat passing.log
#+END_SRC

#+RESULTS:
: trace: warning: Linting is disabled!
: /nix/store/y2caw84i57159wgnxll2d8bwy6wn1wvi-vm-test-run-minimal_test
* Failing Tests
** Introduction
   In this example, we will simply change the test to make it fail.
** test.nix

   We replace "Hello, world!" by "Goodbye, world!", to make the test fail.
#+NAME: test_failing
#+BEGIN_EXAMPLE nix
{ ... }:

{
  name = "minimal_test_failing";
  skipLint = true;

  nodes.server = ./server.nix;

  testScript = ''
    start_all()
    server.wait_for_unit("multi-user.target")
    (status, output) = server.execute("hello")
    assert("Goodbye, world!\n" == output)
  '';
}
#+END_EXAMPLE

#+BEGIN_SRC sh :var test_content=test_failing :exports none
echo "$test_content" > test.nix
#+END_SRC

#+RESULTS:

** server.nix

#+NAME: server
#+BEGIN_EXAMPLE nix
{ pkgs, ... }: 

{
   environment.systemPackages = with pkgs; [
     hello
   ];
}
#+END_EXAMPLE

#+BEGIN_SRC sh :var server_content=server :exports none
echo "$server_content" > server.nix
#+END_SRC

#+RESULTS:

** default.nix

#+NAME: default
#+BEGIN_EXAMPLE sh
{ pkgs ? import <nixpkgs> {} }: {
  test = pkgs.nixosTest ./test.nix;
}
#+END_EXAMPLE

#+BEGIN_SRC sh :var default_content=default :exports none
echo "$default_content" > default.nix
#+END_SRC

#+RESULTS:

** Running the tests

#+BEGIN_SRC sh :results verbatim :exports both
nix-build default.nix 2>&1 > failing.log
cat failing.log
#+END_SRC

#+RESULTS:
#+begin_example
trace: warning: Linting is disabled!
these derivations will be built:
  /nix/store/gryk96pn81hp6w6fbj9vihsac4fqb4xa-vm-test-run-minimal_test_failing.drv
building '/nix/store/gryk96pn81hp6w6fbj9vihsac4fqb4xa-vm-test-run-minimal_test_failing.drv'...
starting VDE switch for network 1
running the VM test script
starting all VMs
server: starting vm
server # Formatting '/build/vm-state-server/server.qcow2', fmt=qcow2 cluster_size=65536 compression_type=zlib size=536870912 lazy_refcounts=off refcount_bits=16
server: QEMU running (pid 9)
(0.03 seconds)
server: waiting for the VM to finish booting
server # cSeaBIOS (version rel-1.13.0-48-gd9c812dda519-prebuilt.qemu.org)
server #
server #
server # iPXE (http://ipxe.org) 00:03.0 CA00 PCI2.10 PnP PMM+17F8ED60+17EEED60 CA00
server # Press Ctrl-B to configure iPXE (PCI 00:03.0)...
server #
server #
server #
server #
server # iPXE (http://ipxe.org) 00:09.0 CB00 PCI2.10 PnP PMM 17F8ED60 17EEED60 CB00
server # Press Ctrl-B to configure iPXE (PCI 00:09.0)...
server #
server #
server # Booting from ROM...
server # Probing EDD (edd=off to disable)... oc[    0.000000] Linux version 5.4.87 (nixbld@localhost) (gcc version 10.2.0 (GCC)) #1-NixOS SMP Wed Jan 6 13:48:41 UTC 2021
server # [    0.000000] Command line: console=ttyS0 panic=1 boot.panic_on_fail loglevel=7 net.ifnames=0 init=/nix/store/h5002765c6dz9qq06agqdx4xbiswci47-nixos-system-server-21.03pre262129.5000e5707bc/init regInfo=/nix/store/4hbj67kr7rbz233zyw764dzgsmd54nmy-closure-info/registration console=ttyS0
server # [    0.000000] x86/fpu: Supporting XSAVE feature 0x001: 'x87 floating point registers'
server # [    0.000000] x86/fpu: Supporting XSAVE feature 0x002: 'SSE registers'
server # [    0.000000] x86/fpu: Supporting XSAVE feature 0x004: 'AVX registers'
server # [    0.000000] x86/fpu: Supporting XSAVE feature 0x008: 'MPX bounds registers'
server # [    0.000000] x86/fpu: Supporting XSAVE feature 0x010: 'MPX CSR'
server # [    0.000000] x86/fpu: xstate_offset[2]:  576, xstate_sizes[2]:  256
server # [    0.000000] x86/fpu: xstate_offset[3]:  832, xstate_sizes[3]:   64
server # [    0.000000] x86/fpu: xstate_offset[4]:  896, xstate_sizes[4]:   64
server # [    0.000000] x86/fpu: Enabled xstate features 0x1f, context size is 960 bytes, using 'compacted' format.
server # [    0.000000] BIOS-provided physical RAM map:
server # [    0.000000] BIOS-e820: [mem 0x0000000000000000-0x000000000009fbff] usable
server # [    0.000000] BIOS-e820: [mem 0x000000000009fc00-0x000000000009ffff] reserved
server # [    0.000000] BIOS-e820: [mem 0x00000000000f0000-0x00000000000fffff] reserved
server # [    0.000000] BIOS-e820: [mem 0x0000000000100000-0x0000000017fdafff] usable
server # [    0.000000] BIOS-e820: [mem 0x0000000017fdb000-0x0000000017ffffff] reserved
server # [    0.000000] BIOS-e820: [mem 0x00000000feffc000-0x00000000feffffff] reserved
server # [    0.000000] BIOS-e820: [mem 0x00000000fffc0000-0x00000000ffffffff] reserved
server # [    0.000000] NX (Execute Disable) protection: active
server # [    0.000000] SMBIOS 2.8 present.
server # [    0.000000] DMI: QEMU Standard PC (i440FX + PIIX, 1996), BIOS rel-1.13.0-48-gd9c812dda519-prebuilt.qemu.org 04/01/2014
server # [    0.000000] Hypervisor detected: KVM
server # [    0.000000] kvm-clock: Using msrs 4b564d01 and 4b564d00
server # [    0.000000] kvm-clock: cpu 0, msr c5ce001, primary cpu clock
server # [    0.000000] kvm-clock: using sched offset of 558187183 cycles
server # [    0.000003] clocksource: kvm-clock: mask: 0xffffffffffffffff max_cycles: 0x1cd42e4dffb, max_idle_ns: 881590591483 ns
server # [    0.000009] tsc: Detected 1607.996 MHz processor
server # [    0.001130] last_pfn = 0x17fdb max_arch_pfn = 0x400000000
server # [    0.001167] x86/PAT: Configuration [0-7]: WB  WC  UC- UC  WB  WP  UC- WT
server # [    0.007028] found SMP MP-table at [mem 0x000f5a60-0x000f5a6f]
server # [    0.007129] check: Scanning 1 areas for low memory corruption
server # [    0.007151] Using GB pages for direct mapping
server # [    0.007301] RAMDISK: [mem 0x176d1000-0x17fcffff]
server # [    0.007313] ACPI: Early table checksum verification disabled
server # [    0.007321] ACPI: RSDP 0x00000000000F5880 000014 (v00 BOCHS )
server # [    0.007327] ACPI: RSDT 0x0000000017FE14D2 000034 (v01 BOCHS  BXPCRSDT 00000001 BXPC 00000001)
server # [    0.007332] ACPI: FACP 0x0000000017FE1386 000074 (v01 BOCHS  BXPCFACP 00000001 BXPC 00000001)
server # [    0.007336] ACPI: DSDT 0x0000000017FE0040 001346 (v01 BOCHS  BXPCDSDT 00000001 BXPC 00000001)
server # [    0.007338] ACPI: FACS 0x0000000017FE0000 000040
server # [    0.007340] ACPI: APIC 0x0000000017FE13FA 000078 (v01 BOCHS  BXPCAPIC 00000001 BXPC 00000001)
server # [    0.007342] ACPI: HPET 0x0000000017FE1472 000038 (v01 BOCHS  BXPCHPET 00000001 BXPC 00000001)
server # [    0.007344] ACPI: WAET 0x0000000017FE14AA 000028 (v01 BOCHS  BXPCWAET 00000001 BXPC 00000001)
server # [    0.007525] No NUMA configuration found
server # [    0.007526] Faking a node at [mem 0x0000000000000000-0x0000000017fdafff]
server # [    0.007530] NODE_DATA(0) allocated [mem 0x17fd6000-0x17fdafff]
server # [    0.007643] Zone ranges:
server # [    0.007644]   DMA      [mem 0x0000000000001000-0x0000000000ffffff]
server # [    0.007645]   DMA32    [mem 0x0000000001000000-0x0000000017fdafff]
server # [    0.007646]   Normal   empty
server # [    0.007647]   Device   empty
server # [    0.007647] Movable zone start for each node
server # [    0.007648] Early memory node ranges
server # [    0.007649]   node   0: [mem 0x0000000000001000-0x000000000009efff]
server # [    0.007649]   node   0: [mem 0x0000000000100000-0x0000000017fdafff]
server # [    0.007826] Zeroed struct page in unavailable ranges: 135 pages
server # [    0.007827] Initmem setup node 0 [mem 0x0000000000001000-0x0000000017fdafff]
server # [    0.009087] ACPI: PM-Timer IO Port: 0x608
server # [    0.009096] ACPI: LAPIC_NMI (acpi_id[0xff] dfl dfl lint[0x1])
server # [    0.009115] IOAPIC[0]: apic_id 0, version 17, address 0xfec00000, GSI 0-23
server # [    0.009118] ACPI: INT_SRC_OVR (bus 0 bus_irq 0 global_irq 2 dfl dfl)
server # [    0.009119] ACPI: INT_SRC_OVR (bus 0 bus_irq 5 global_irq 5 high level)
server # [    0.009119] ACPI: INT_SRC_OVR (bus 0 bus_irq 9 global_irq 9 high level)
server # [    0.009123] ACPI: INT_SRC_OVR (bus 0 bus_irq 10 global_irq 10 high level)
server # [    0.009123] ACPI: INT_SRC_OVR (bus 0 bus_irq 11 global_irq 11 high level)
server # [    0.009127] Using ACPI (MADT) for SMP configuration information
server # [    0.009129] ACPI: HPET id: 0x8086a201 base: 0xfed00000
server # [    0.009131] TSC deadline timer available
server # [    0.009135] smpboot: Allowing 1 CPUs, 0 hotplug CPUs
server # [    0.009146] KVM setup pv sched yield
server # [    0.009151] PM: Registered nosave memory: [mem 0x00000000-0x00000fff]
server # [    0.009152] PM: Registered nosave memory: [mem 0x0009f000-0x0009ffff]
server # [    0.009153] PM: Registered nosave memory: [mem 0x000a0000-0x000effff]
server # [    0.009154] PM: Registered nosave memory: [mem 0x000f0000-0x000fffff]
server # [    0.009155] [mem 0x18000000-0xfeffbfff] available for PCI devices
server # [    0.009155] Booting paravirtualized kernel on KVM
server # [    0.009158] clocksource: refined-jiffies: mask: 0xffffffff max_cycles: 0xffffffff, max_idle_ns: 1910969940391419 ns
server # [    0.067600] setup_percpu: NR_CPUS:384 nr_cpumask_bits:384 nr_cpu_ids:1 nr_node_ids:1
server # [    0.067770] percpu: Embedded 53 pages/cpu s176920 r8192 d31976 u2097152
server # [    0.067790] KVM setup async PF for cpu 0
server # [    0.067794] kvm-stealtime: cpu 0, msr 16c17100
server # [    0.067800] Built 1 zonelists, mobility grouping on.  Total pages: 96612
server # [    0.067801] Policy zone: DMA32
server # [    0.067802] Kernel command line: console=ttyS0 panic=1 boot.panic_on_fail loglevel=7 net.ifnames=0 init=/nix/store/h5002765c6dz9qq06agqdx4xbiswci47-nixos-system-server-21.03pre262129.5000e5707bc/init regInfo=/nix/store/4hbj67kr7rbz233zyw764dzgsmd54nmy-closure-info/registration console=ttyS0
server # [    0.067856] Dentry cache hash table entries: 65536 (order: 7, 524288 bytes, linear)
server # [    0.067865] Inode-cache hash table entries: 32768 (order: 6, 262144 bytes, linear)
server # [    0.067893] mem auto-init: stack:off, heap alloc:off, heap free:off
server # [    0.068402] Memory: 351560K/392676K available (10243K kernel code, 1137K rwdata, 2160K rodata, 1536K init, 2384K bss, 41116K reserved, 0K cma-reserved)
server # [    0.068528] SLUB: HWalign=64, Order=0-3, MinObjects=0, CPUs=1, Nodes=1
server # [    0.068537] ftrace: allocating 30991 entries in 122 pages
server # [    0.077425] rcu: Hierarchical RCU implementation.
server # [    0.077426] rcu:    RCU event tracing is enabled.
server # [    0.077427] rcu:    RCU restricting CPUs from NR_CPUS=384 to nr_cpu_ids=1.
server # [    0.077428] rcu: RCU calculated value of scheduler-enlistment delay is 100 jiffies.
server # [    0.077429] rcu: Adjusting geometry for rcu_fanout_leaf=16, nr_cpu_ids=1
server # [    0.079144] NR_IRQS: 24832, nr_irqs: 256, preallocated irqs: 16
server # [    0.079261] random: get_random_bytes called from start_kernel+0x319/0x4ed with crng_init=0
server # [    0.082090] Console: colour VGA+ 80x25
server # [    0.142112] printk: console [ttyS0] enabled
server # [    0.142501] ACPI: Core revision 20190816
server # [    0.142953] clocksource: hpet: mask: 0xffffffff max_cycles: 0xffffffff, max_idle_ns: 19112604467 ns
server # [    0.143844] APIC: Switch to symmetric I/O mode setup
server # [    0.144423] x2apic enabled
server # [    0.144809] Switched APIC routing to physical x2apic.
server # [    0.145280] KVM setup pv IPIs
server # [    0.146122] ..TIMER: vector=0x30 apic1=0 pin1=2 apic2=-1 pin2=-1
server # [    0.146665] clocksource: tsc-early: mask: 0xffffffffffffffff max_cycles: 0x172da68deef, max_idle_ns: 440795285945 ns
server # [    0.147650] Calibrating delay loop (skipped) preset value.. 3215.99 BogoMIPS (lpj=1607996)
server # [    0.148650] pid_max: default: 32768 minimum: 301
server # [    0.149665] LSM: Security Framework initializing
server # [    0.150077] Yama: becoming mindful.
server # [    0.150390] SELinux:  Initializing.
server # [    0.150661] Mount-cache hash table entries: 1024 (order: 1, 8192 bytes, linear)
server # [    0.151300] Mountpoint-cache hash table entries: 1024 (order: 1, 8192 bytes, linear)
server # [    0.151823] x86/cpu: User Mode Instruction Prevention (UMIP) activated
server # [    0.152693] Last level iTLB entries: 4KB 0, 2MB 0, 4MB 0
server # [    0.153160] Last level dTLB entries: 4KB 0, 2MB 0, 4MB 0, 1GB 0
server # [    0.153652] Spectre V1 : Mitigation: usercopy/swapgs barriers and __user pointer sanitization
server # [    0.154651] Spectre V2 : Mitigation: Enhanced IBRS
server # [    0.155074] Spectre V2 : Spectre v2 / SpectreRSB mitigation: Filling RSB on context switch
server # [    0.155650] Spectre V2 : mitigation: Enabling conditional Indirect Branch Prediction Barrier
server # [    0.156377] Speculative Store Bypass: Mitigation: Speculative Store Bypass disabled via prctl and seccomp
server # [    0.159418] Freeing SMP alternatives memory: 28K
server # [    0.160940] smpboot: CPU0: Intel(R) Core(TM) i7-10810U CPU @ 1.10GHz (family: 0x6, model: 0xa6, stepping: 0x0)
server # [    0.161648] Performance Events: Skylake events, Intel PMU driver.
server # [    0.161652] ... version:                2
server # [    0.162007] ... bit width:              48
server # [    0.162363] ... generic registers:      4
server # [    0.162651] ... value mask:             0000ffffffffffff
server # [    0.163114] ... max period:             000000007fffffff
server # [    0.163573] ... fixed-purpose events:   3
server # [    0.163651] ... event mask:             000000070000000f
server # [    0.164138] rcu: Hierarchical SRCU implementation.
server # [    0.164732] smp: Bringing up secondary CPUs ...
server # [    0.165134] smp: Brought up 1 node, 1 CPU
server # [    0.165483] smpboot: Max logical packages: 1
server # [    0.165653] smpboot: Total of 1 processors activated (3215.99 BogoMIPS)
server # [    0.166307] devtmpfs: initialized
server # [    0.166631] x86/mm: Memory block size: 128MB
server # [    0.166753] clocksource: jiffies: mask: 0xffffffff max_cycles: 0xffffffff, max_idle_ns: 1911260446275000 ns
server # [    0.167603] futex hash table entries: 256 (order: 2, 16384 bytes, linear)
server # [    0.167673] pinctrl core: initialized pinctrl subsystem
server # [    0.168207] NET: Registered protocol family 16
server # [    0.168642] audit: initializing netlink subsys (disabled)
server # [    0.168711] cpuidle: using governor menu
server # [    0.169081] KVM setup pv remote TLB flush
server # [    0.169435] ACPI: bus type PCI registered
server # [    0.169651] acpiphp: ACPI Hot Plug PCI Controller Driver version: 0.5
server # [    0.170273] PCI: Using configuration type 1 for base access
server # [    0.171266] audit: type=2000 audit(1610617881.357:1): state=initialized audit_enabled=0 res=1
server # [    0.171696] HugeTLB registered 1.00 GiB page size, pre-allocated 0 pages
server # [    0.172281] HugeTLB registered 2.00 MiB page size, pre-allocated 0 pages
server # [    0.172866] ACPI: Added _OSI(Module Device)
server # [    0.173241] ACPI: Added _OSI(Processor Device)
server # [    0.173627] ACPI: Added _OSI(3.0 _SCP Extensions)
server # [    0.173655] ACPI: Added _OSI(Processor Aggregator Device)
server # [    0.174129] ACPI: Added _OSI(Linux-Dell-Video)
server # [    0.174517] ACPI: Added _OSI(Linux-Lenovo-NV-HDMI-Audio)
server # [    0.174655] ACPI: Added _OSI(Linux-HPI-Hybrid-Graphics)
server # [    0.175380] ACPI: 1 ACPI AML tables successfully acquired and loaded
server # [    0.176312] ACPI: Interpreter enabled
server # [    0.176645] ACPI: (supports S0 S3 S4 S5)
server # [    0.176663] ACPI: Using IOAPIC for interrupt routing
server # [    0.177106] PCI: Using host bridge windows from ACPI; if necessary, use "pci=nocrs" and report a bug
server # [    0.177706] ACPI: Enabled 2 GPEs in block 00 to 0F
server # [    0.179177] ACPI: PCI Root Bridge [PCI0] (domain 0000 [bus 00-ff])
server # [    0.179654] acpi PNP0A03:00: _OSC: OS supports [ASPM ClockPM Segments MSI HPX-Type3]
server # [    0.180334] acpi PNP0A03:00: fail to add MMCONFIG information, can't access extended PCI configuration space under this bridge.
server # [    0.180699] acpiphp: Slot [3] registered
server # [    0.181062] acpiphp: Slot [4] registered
server # [    0.181416] acpiphp: Slot [5] registered
server # [    0.181664] acpiphp: Slot [6] registered
server # [    0.182053] acpiphp: Slot [7] registered
server # [    0.182490] acpiphp: Slot [8] registered
server # [    0.182665] acpiphp: Slot [9] registered
server # [    0.183022] acpiphp: Slot [10] registered
server # [    0.183387] acpiphp: Slot [11] registered
server # [    0.183664] acpiphp: Slot [12] registered
server # [    0.184030] acpiphp: Slot [13] registered
server # [    0.184441] acpiphp: Slot [14] registered
server # [    0.184663] acpiphp: Slot [15] registered
server # [    0.185028] acpiphp: Slot [16] registered
server # [    0.185394] acpiphp: Slot [17] registered
server # [    0.185663] acpiphp: Slot [18] registered
server # [    0.186026] acpiphp: Slot [19] registered
server # [    0.186434] acpiphp: Slot [20] registered
server # [    0.186664] acpiphp: Slot [21] registered
server # [    0.187076] acpiphp: Slot [22] registered
server # [    0.187439] acpiphp: Slot [23] registered
server # [    0.187663] acpiphp: Slot [24] registered
server # [    0.188074] acpiphp: Slot [25] registered
server # [    0.188437] acpiphp: Slot [26] registered
server # [    0.188665] acpiphp: Slot [27] registered
server # [    0.189030] acpiphp: Slot [28] registered
server # [    0.189393] acpiphp: Slot [29] registered
server # [    0.189663] acpiphp: Slot [30] registered
server # [    0.190026] acpiphp: Slot [31] registered
server # [    0.190383] PCI host bridge to bus 0000:00
server # [    0.190652] pci_bus 0000:00: root bus resource [io  0x0000-0x0cf7 window]
server # [    0.191240] pci_bus 0000:00: root bus resource [io  0x0d00-0xffff window]
server # [    0.191651] pci_bus 0000:00: root bus resource [mem 0x000a0000-0x000bffff window]
server # [    0.192301] pci_bus 0000:00: root bus resource [mem 0x18000000-0xfebfffff window]
server # [    0.192651] pci_bus 0000:00: root bus resource [mem 0x100000000-0x17fffffff window]
server # [    0.193403] pci_bus 0000:00: root bus resource [bus 00-ff]
server # [    0.193673] pci 0000:00:00.0: [8086:1237] type 00 class 0x060000
server # [    0.194452] pci 0000:00:01.0: [8086:7000] type 00 class 0x060100
server # [    0.194996] pci 0000:00:01.1: [8086:7010] type 00 class 0x010180
server # [    0.197462] pci 0000:00:01.1: reg 0x20: [io  0xc1c0-0xc1cf]
server # [    0.198419] pci 0000:00:01.1: legacy IDE quirk: reg 0x10: [io  0x01f0-0x01f7]
server # [    0.198652] pci 0000:00:01.1: legacy IDE quirk: reg 0x14: [io  0x03f6]
server # [    0.199223] pci 0000:00:01.1: legacy IDE quirk: reg 0x18: [io  0x0170-0x0177]
server # [    0.199651] pci 0000:00:01.1: legacy IDE quirk: reg 0x1c: [io  0x0376]
server # [    0.200313] pci 0000:00:01.2: [8086:7020] type 00 class 0x0c0300
server # [    0.202422] pci 0000:00:01.2: reg 0x20: [io  0xc0c0-0xc0df]
server # [    0.203435] pci 0000:00:01.3: [8086:7113] type 00 class 0x068000
server # [    0.203913] pci 0000:00:01.3: quirk: [io  0x0600-0x063f] claimed by PIIX4 ACPI
server # [    0.204547] pci 0000:00:01.3: quirk: [io  0x0700-0x070f] claimed by PIIX4 SMB
server # [    0.204777] pci 0000:00:02.0: [1234:1111] type 00 class 0x030000
server # [    0.206164] pci 0000:00:02.0: reg 0x10: [mem 0xfd000000-0xfdffffff pref]
server # [    0.208148] pci 0000:00:02.0: reg 0x18: [mem 0xfebd0000-0xfebd0fff]
server # [    0.211626] pci 0000:00:02.0: reg 0x30: [mem 0xfebc0000-0xfebcffff pref]
server # [    0.211908] pci 0000:00:03.0: [1af4:1000] type 00 class 0x020000
server # [    0.213052] pci 0000:00:03.0: reg 0x10: [io  0xc0e0-0xc0ff]
server # [    0.214251] pci 0000:00:03.0: reg 0x14: [mem 0xfebd1000-0xfebd1fff]
server # [    0.217653] pci 0000:00:03.0: reg 0x20: [mem 0xfe000000-0xfe003fff 64bit pref]
server # [    0.219412] pci 0000:00:03.0: reg 0x30: [mem 0xfeb40000-0xfeb7ffff pref]
server # [    0.220043] pci 0000:00:04.0: [1af4:1005] type 00 class 0x00ff00
server # [    0.220918] pci 0000:00:04.0: reg 0x10: [io  0xc100-0xc11f]
server # [    0.223437] pci 0000:00:04.0: reg 0x20: [mem 0xfe004000-0xfe007fff 64bit pref]
server # [    0.224539] pci 0000:00:05.0: [1af4:1009] type 00 class 0x000200
server # [    0.225483] pci 0000:00:05.0: reg 0x10: [io  0xc120-0xc13f]
server # [    0.226393] pci 0000:00:05.0: reg 0x14: [mem 0xfebd2000-0xfebd2fff]
server # [    0.228652] pci 0000:00:05.0: reg 0x20: [mem 0xfe008000-0xfe00bfff 64bit pref]
server # [    0.230033] pci 0000:00:06.0: [1af4:1009] type 00 class 0x000200
server # [    0.231016] pci 0000:00:06.0: reg 0x10: [io  0xc140-0xc15f]
server # [    0.232024] pci 0000:00:06.0: reg 0x14: [mem 0xfebd3000-0xfebd3fff]
server # [    0.234403] pci 0000:00:06.0: reg 0x20: [mem 0xfe00c000-0xfe00ffff 64bit pref]
server # [    0.235757] pci 0000:00:07.0: [1af4:1009] type 00 class 0x000200
server # [    0.237001] pci 0000:00:07.0: reg 0x10: [io  0xc160-0xc17f]
server # [    0.237999] pci 0000:00:07.0: reg 0x14: [mem 0xfebd4000-0xfebd4fff]
server # [    0.240341] pci 0000:00:07.0: reg 0x20: [mem 0xfe010000-0xfe013fff 64bit pref]
server # [    0.241708] pci 0000:00:08.0: [1af4:1001] type 00 class 0x010000
server # [    0.243034] pci 0000:00:08.0: reg 0x10: [io  0xc000-0xc07f]
server # [    0.244014] pci 0000:00:08.0: reg 0x14: [mem 0xfebd5000-0xfebd5fff]
server # [    0.246652] pci 0000:00:08.0: reg 0x20: [mem 0xfe014000-0xfe017fff 64bit pref]
server # [    0.248365] pci 0000:00:09.0: [1af4:1000] type 00 class 0x020000
server # [    0.249392] pci 0000:00:09.0: reg 0x10: [io  0xc180-0xc19f]
server # [    0.250333] pci 0000:00:09.0: reg 0x14: [mem 0xfebd6000-0xfebd6fff]
server # [    0.252652] pci 0000:00:09.0: reg 0x20: [mem 0xfe018000-0xfe01bfff 64bit pref]
server # [    0.254358] pci 0000:00:09.0: reg 0x30: [mem 0xfeb80000-0xfebbffff pref]
server # [    0.255031] pci 0000:00:0a.0: [1af4:1003] type 00 class 0x078000
server # [    0.256363] pci 0000:00:0a.0: reg 0x10: [io  0xc080-0xc0bf]
server # [    0.257401] pci 0000:00:0a.0: reg 0x14: [mem 0xfebd7000-0xfebd7fff]
server # [    0.259653] pci 0000:00:0a.0: reg 0x20: [mem 0xfe01c000-0xfe01ffff 64bit pref]
server # [    0.261393] pci 0000:00:0b.0: [1af4:1005] type 00 class 0x00ff00
server # [    0.262198] pci 0000:00:0b.0: reg 0x10: [io  0xc1a0-0xc1bf]
server # [    0.264375] pci 0000:00:0b.0: reg 0x20: [mem 0xfe020000-0xfe023fff 64bit pref]
server # [    0.265726] ACPI: PCI Interrupt Link [LNKA] (IRQs 5 *10 11)
server # [    0.266285] ACPI: PCI Interrupt Link [LNKB] (IRQs 5 *10 11)
server # [    0.266708] ACPI: PCI Interrupt Link [LNKC] (IRQs 5 10 *11)
server # [    0.267258] ACPI: PCI Interrupt Link [LNKD] (IRQs 5 10 *11)
server # [    0.267687] ACPI: PCI Interrupt Link [LNKS] (IRQs *9)
server # [    0.268315] iommu: Default domain type: Translated
server # [    0.268705] pci 0000:00:02.0: vgaarb: setting as boot VGA device
server # [    0.269237] pci 0000:00:02.0: vgaarb: VGA device added: decodes=io+mem,owns=io+mem,locks=none
server # [    0.269652] pci 0000:00:02.0: vgaarb: bridge control possible
server # [    0.270157] vgaarb: loaded
server # [    0.270636] PCI: Using ACPI for IRQ routing
server # [    0.271261] NetLabel: Initializing
server # [    0.271567] NetLabel:  domain hash size = 128
server # [    0.271651] NetLabel:  protocols = UNLABELED CIPSOv4 CALIPSO
server # [    0.272328] NetLabel:  unlabeled traffic allowed by default
server # [    0.272678] hpet0: at MMIO 0xfed00000, IRQs 2, 8, 0
server # [    0.273112] hpet0: 3 comparators, 64-bit 100.000000 MHz counter
server # [    0.277678] clocksource: Switched to clocksource kvm-clock
server # [    0.283776] VFS: Disk quotas dquot_6.6.0
server # [    0.284146] VFS: Dquot-cache hash table entries: 512 (order 0, 4096 bytes)
server # [    0.284797] pnp: PnP ACPI init
server # [    0.285267] pnp: PnP ACPI: found 6 devices
server # [    0.286323] thermal_sys: Registered thermal governor 'bang_bang'
server # [    0.286324] thermal_sys: Registered thermal governor 'step_wise'
server # [    0.286866] thermal_sys: Registered thermal governor 'user_space'
server # [    0.291955] clocksource: acpi_pm: mask: 0xffffff max_cycles: 0xffffff, max_idle_ns: 2085701024 ns
server # [    0.293295] pci_bus 0000:00: resource 4 [io  0x0000-0x0cf7 window]
server # [    0.293893] pci_bus 0000:00: resource 5 [io  0x0d00-0xffff window]
server # [    0.294440] pci_bus 0000:00: resource 6 [mem 0x000a0000-0x000bffff window]
server # [    0.295095] pci_bus 0000:00: resource 7 [mem 0x18000000-0xfebfffff window]
server # [    0.295706] pci_bus 0000:00: resource 8 [mem 0x100000000-0x17fffffff window]
server # [    0.296356] NET: Registered protocol family 2
server # [    0.296856] tcp_listen_portaddr_hash hash table entries: 256 (order: 0, 4096 bytes, linear)
server # [    0.297665] TCP established hash table entries: 4096 (order: 3, 32768 bytes, linear)
server # [    0.298348] TCP bind hash table entries: 4096 (order: 4, 65536 bytes, linear)
server # [    0.299038] TCP: Hash tables configured (established 4096 bind 4096)
server # [    0.299615] UDP hash table entries: 256 (order: 1, 8192 bytes, linear)
server # [    0.300202] UDP-Lite hash table entries: 256 (order: 1, 8192 bytes, linear)
server # [    0.300852] NET: Registered protocol family 1
server # [    0.301246] NET: Registered protocol family 44
server # [    0.301708] pci 0000:00:01.0: PIIX3: Enabling Passive Release
server # [    0.302223] pci 0000:00:00.0: Limiting direct PCI/PCI transfers
server # [    0.302803] pci 0000:00:01.0: Activating ISA DMA hang workarounds
server # [    0.313473] PCI Interrupt Link [LNKD] enabled at IRQ 11
server # [    0.324129] pci 0000:00:01.2: quirk_usb_early_handoff+0x0/0x6ad took 20288 usecs
server # [    0.324816] pci 0000:00:02.0: Video device with shadowed ROM at [mem 0x000c0000-0x000dffff]
server # [    0.325712] PCI: CLS 0 bytes, default 64
server # [    0.326151] Trying to unpack rootfs image as initramfs...
server # [    0.404989] Freeing initrd memory: 9212K
server # [    0.405394] clocksource: tsc: mask: 0xffffffffffffffff max_cycles: 0x172da68deef, max_idle_ns: 440795285945 ns
server # [    0.406359] check: Scanning for low memory corruption every 60 seconds
server # [    0.407127] Initialise system trusted keyrings
server # [    0.407556] workingset: timestamp_bits=40 max_order=17 bucket_order=0
server # [    0.408800] zbud: loaded
server # [    0.409197] Key type asymmetric registered
server # [    0.409567] Asymmetric key parser 'x509' registered
server # [    0.410003] Block layer SCSI generic (bsg) driver version 0.4 loaded (major 251)
server # [    0.410682] io scheduler mq-deadline registered
server # [    0.411083] io scheduler kyber registered
server # [    0.411555] Serial: 8250/16550 driver, 4 ports, IRQ sharing enabled
server # [    0.434206] 00:04: ttyS0 at I/O 0x3f8 (irq = 4, base_baud = 115200) is a 16550A
server # [    0.435848] brd: module loaded
server # [    0.436136] intel_pstate: CPU model not supported
server # [    0.436562] drop_monitor: Initializing network drop monitor service
server # [    0.437196] NET: Registered protocol family 10
server # [    0.437731] Segment Routing with IPv6
server # [    0.438130] IPI shorthand broadcast: enabled
server # [    0.438517] sched_clock: Marking stable (372225861, 65424044)->(470109681, -32459776)
server # [    0.439251] registered taskstats version 1
server # [    0.439616] Loading compiled-in X.509 certificates
server # [    0.440502] Loaded X.509 cert 'Build time autogenerated kernel key: e55975cd9676589d5e30551eb715d948f11042b3'
server # [    0.441384] zswap: loaded using pool lzo/zbud
server # [    0.441862] Key type ._fscrypt registered
server # [    0.442217] Key type .fscrypt registered
server # [    0.443611] Freeing unused kernel image memory: 1536K
server # [    0.445667] Write protecting the kernel read-only data: 16384k
server # [    0.447117] Freeing unused kernel image memory: 2012K
server # [    0.447723] Freeing unused kernel image memory: 1936K
server # [    0.448172] Run /init as init process
server #
server # <<< NixOS Stage 1 >>>
server #
server # loading module virtio_balloon...
server # loading module virtio_console...
server # loading module virtio_rng...
server # loading module dm_mod...
server # [    0.481408] device-mapper: ioctl: 4.41.0-ioctl (2019-09-16) initialised: dm-devel@redhat.com
server # running udev...
server # Starting version 247
server # [    0.517956] rtc_cmos 00:05: RTC can wake from S4
server # [    0.518806] i8042: PNP: PS/2 Controller [PNP0303:KBD,PNP0f13:MOU] at 0x60,0x64 irq 1,12
server # [    0.521985] rtc_cmos 00:05: registered as rtc0
server # [    0.522404] rtc_cmos 00:05: alarms up to one day, y3k, 242 bytes nvram, hpet irqs
server # [    0.524156] serio: i8042 KBD port at 0x60,0x64 irq 1
server # [    0.524603] serio: i8042 AUX port at 0x60,0x64 irq 12
server # [    0.564850] SCSI subsystem initialized
server # [    0.582979] PCI Interrupt Link [LNKC] enabled at IRQ 10
server # [    0.584368] ACPI: bus type USB registered
server # [    0.584753] usbcore: registered new interface driver usbfs
server # [    0.585242] usbcore: registered new interface driver hub
server # [    0.591667] usbcore: registered new device driver usb
server # [    0.606931] ehci_hcd: USB 2.0 'Enhanced' Host Controller (EHCI) Driver
server # [    0.617781] uhci_hcd: USB Universal Host Controller Interface driver
server # [    0.619660] scsi host0: ata_piix
server # [    0.625657] scsi host1: ata_piix
server # [    0.625954] ata1: PATA max MWDMA2 cmd 0x1f0 ctl 0x3f6 bmdma 0xc1c0 irq 14
server # [    0.626553] ata2: PATA max MWDMA2 cmd 0x170 ctl 0x376 bmdma 0xc1c8 irq 15
server # [    0.643445] uhci_hcd 0000:00:01.2: UHCI Host Controller
server # [    0.643898] uhci_hcd 0000:00:01.2: new USB bus registered, assigned bus number 1
server # [    0.644554] uhci_hcd 0000:00:01.2: detected 2 ports
server # [    0.646695] random: fast init done
server # [    0.647057] random: crng init done
server # [    0.650693] uhci_hcd 0000:00:01.2: irq 11, io base 0x0000c0c0
server # [    0.653664] usb usb1: New USB device found, idVendor=1d6b, idProduct=0001, bcdDevice= 5.04
server # [    0.654390] usb usb1: New USB device strings: Mfr=3, Product=2, SerialNumber=1
server # [    0.655026] usb usb1: Product: UHCI Host Controller
server # [    0.655469] usb usb1: Manufacturer: Linux 5.4.87 uhci_hcd
server # [    0.656000] usb usb1: SerialNumber: 0000:00:01.2
server # [    0.661708] hub 1-0:1.0: USB hub found
server # [    0.662657] hub 1-0:1.0: 2 ports detected
server # [    0.672433] PCI Interrupt Link [LNKA] enabled at IRQ 10
server # [    0.695692] PCI Interrupt Link [LNKB] enabled at IRQ 11
server # [    0.785636] ata2.00: ATAPI: QEMU DVD-ROM, 2.5+, max UDMA/100
server # [    0.786891] scsi 1:0:0:0: CD-ROM            QEMU     QEMU DVD-ROM     2.5+ PQ: 0 ANSI: 5
server # [    0.843710] input: AT Translated Set 2 keyboard as /devices/platform/i8042/serio0/input/input0
server # [    0.857654] 9pnet: Installing 9P2000 support
server # [    0.862435] virtio_blk virtio5: [vda] 1048576 512-byte logical blocks (537 MB/512 MiB)
server # [    0.879106] SELinux: unrecognized netlink message: protocol=0 nlmsg_type=108 sclass=netlink_route_socket pid=116 comm=systemd-udevd
server # [    0.881683] SELinux: unrecognized netlink message: protocol=0 nlmsg_type=108 sclass=netlink_route_socket pid=122 comm=systemd-udevd
server # [    0.894997] sr 1:0:0:0: [sr0] scsi3-mmc drive: 4x/4x cd/rw xa/form2 tray
server # [    0.895612] cdrom: Uniform CD-ROM driver Revision: 3.20
server # [    0.986696] usb 1-1: new full-speed USB device number 2 using uhci_hcd
server # kbd_mode: KDSKBMODE: Inappropriate ioctl for device
server # %Gstarting device mapper and LVM...
server # hwclock: settimeofday: Invalid argument
server # [    1.123854] clocksource: Switched to clocksource acpi_pm
server # mke2fs 1.45.6 (20-Mar-2020)
server # Discarding device blocks:   4096/131072             done
server # Creating filesystem with 131072 4k blocks and 32768 inodes
server # Filesystem UUID: 7776ff9f-a967-4330-8972-d47d7eeb6635
server # Superblock backups stored on blocks:
server #        32768, 98304
server #
server # Allocating group tables: 0/4   done
server # Writing inode tables: 0/4   done
server # Creating journal (4096 blocks): done
server # Writing superblocks and filesystem accounting information: 0/4   done
server #
server # checking /dev/vda...
server # fsck (busybox 1.32.0)
server # [fsck.ext4 (1) -- /mnt-root/] fsck.ext4 -a /dev/vda
server # /dev/vda: clean, 11/32768 files, 6353/131072 blocks
server # [    1.158279] usb 1-1: New USB device found, idVendor=0627, idProduct=0001, bcdDevice= 0.00
server # [    1.159141] usb 1-1: New USB device strings: Mfr=1, Product=3, SerialNumber=10
server # [    1.159801] usb 1-1: Product: QEMU USB Tablet
server # [    1.160199] usb 1-1: Manufacturer: QEMU
server # [    1.160545] usb 1-1: SerialNumber: 28754-0000:00:01.2-1
server # mounting /dev/vda on /...
server # [    1.172834] hidraw: raw HID events driver (C) Jiri Kosina
server # [    1.184648] usbcore: registered new interface driver usbhid
server # [    1.185164] usbhid: USB HID core driver
server # [    1.186836] input: QEMU QEMU USB Tablet as /devices/pci0000:00/0000:00:01.2/usb1/1-1/1-1:1.0/0003:0627:0001.0001/input/input2
server # [    1.188751] hid-generic 0003:0627:0001.0001: input,hidraw0: USB HID v0.01 Mouse [QEMU QEMU USB Tablet] on usb-0000:00:01.2-1/input0
server # [    1.214307] EXT4-fs (vda): mounted filesystem with ordered data mode. Opts: (null)
server # mounting store on /nix/.ro-store...
server # [    1.228375] FS-Cache: Loaded
server # [    1.231734] 9p: Installing v9fs 9p2000 file system support
server # [    1.232441] FS-Cache: Netfs '9p' registered for caching
server # mounting tmpfs on /nix/.rw-store...
server # mounting shared on /tmp/shared...
server # mounting xchg on /tmp/xchg...
server # mounting overlay filesystem on /nix/store...
server #
server # <<< NixOS Stage 2 >>>
server #
server # [    1.348789] EXT4-fs (vda): re-mounted. Opts: (null)
server # [    1.349753] booting system configuration /nix/store/h5002765c6dz9qq06agqdx4xbiswci47-nixos-system-server-21.03pre262129.5000e5707bc
server # running activation script...
server # setting up /etc...
server # starting systemd...
server # [    2.397861] systemd[1]: Inserted module 'autofs4'
server # [    2.408953] cgroup2: Unknown parameter 'memory_recursiveprot'
server # [    2.411472] systemd[1]: systemd 247 running in system mode. (+PAM +AUDIT -SELINUX +IMA +APPARMOR +SMACK -SYSVINIT +UTMP +LIBCRYPTSETUP +GCRYPT -GNUTLS +ACL +XZ +LZ4 -ZSTD +SECCOMP +BLKID -ELFUTILS +KMOD +IDN2 -IDN +PCRE2 default-hierarchy=unified)
server # [    2.413756] systemd[1]: Detected virtualization kvm.
server # [    2.414204] systemd[1]: Detected architecture x86-64.
server # [    2.415366] systemd[1]: Set hostname to <server>.
server # [    2.417246] systemd[1]: Initializing machine ID from random generator.
server # [    2.471235] systemd-fstab-generator[433]: Checking was requested for "store", but it is not a device.
server # [    2.475910] systemd-fstab-generator[433]: Checking was requested for "shared", but it is not a device.
server # [    2.477505] systemd-fstab-generator[433]: Checking was requested for "xchg", but it is not a device.
server # [    2.732033] systemd[1]: Queued start job for default target Multi-User System.
server # [    2.734290] systemd[1]: Created slice system-getty.slice.
server # [    2.735123] systemd[1]: Created slice User and Session Slice.
server # [    2.735790] systemd[1]: Started Dispatch Password Requests to Console Directory Watch.
server # [    2.736608] systemd[1]: Started Forward Password Requests to Wall Directory Watch.
server # [    2.737445] systemd[1]: Reached target Local Encrypted Volumes.
server # [    2.738077] systemd[1]: Reached target Containers.
server # [    2.738585] systemd[1]: Reached target Paths.
server # [    2.739067] systemd[1]: Reached target Remote File Systems.
server # [    2.739634] systemd[1]: Reached target Slices.
server # [    2.740123] systemd[1]: Reached target Swap.
server # [    2.742442] systemd[1]: Listening on Process Core Dump Socket.
server # [    2.743450] systemd[1]: Listening on Journal Audit Socket.
server # [    2.744167] systemd[1]: Listening on Journal Socket (/dev/log).
server # [    2.744876] systemd[1]: Listening on Journal Socket.
server # [    2.746159] systemd[1]: Listening on udev Control Socket.
server # [    2.746895] systemd[1]: Listening on udev Kernel Socket.
server # [    2.748060] systemd[1]: Mounting Huge Pages File System...
server # [    2.749258] systemd[1]: Mounting POSIX Message Queue File System...
server # [    2.749997] systemd[1]: Condition check resulted in FUSE Control File System being skipped.
server # [    2.750894] systemd[1]: Condition check resulted in Kernel Configuration File System being skipped.
server # [    2.753051] systemd[1]: Mounting Kernel Debug File System...
server # [    2.756413] systemd[1]: Starting Create list of static device nodes for the current kernel...
server # [    2.757787] systemd[1]: Condition check resulted in File System Check on Root Device being skipped.
server # [    2.764826] systemd[1]: Starting Journal Service...
server # [    2.766989] systemd[1]: Starting Load Kernel Modules...
server # [    2.772865] systemd[1]: Starting Remount Root and Kernel File Systems...
server # [    2.777903] systemd[1]: Starting Coldplug All udev Devices...
server # [    2.794273] systemd[1]: Mounted Huge Pages File System.
server # [    2.804765] EXT4-fs (vda): re-mounted. Opts: (null)
server # [    2.805414] systemd[1]: Mounted POSIX Message Queue File System.
server # [    2.810999] systemd[1]: Mounted Kernel Debug File System.
server # [    2.815784] systemd[1]: Finished Create list of static device nodes for the current kernel.
server # [    2.819787] systemd[1]: Finished Remount Root and Kernel File Systems.
server # [    2.824801] systemd[1]: Starting Load/Save Random Seed...
server # [    2.829986] bridge: filtering via arp/ip/ip6tables is no longer available by default. Update your scripts to load br_netfilter if you need this.
server # [    2.831866] systemd[1]: Starting Create Static Device Nodes in /dev...
server # [    2.852226] systemd[1]: Finished Load/Save Random Seed.
server # [    2.868671] systemd[1]: Finished Create Static Device Nodes in /dev.
server # [    2.869537] systemd[1]: Reached target Local File Systems (Pre).
server # [    2.870193] systemd[1]: Reached target Local File Systems.
server # [    2.872970] systemd[1]: Starting Rule-based Manager for Device Events and Files...
server # [    2.874437] tun: Universal TUN/TAP device driver, 1.6
server # [    2.895295] loop: module loaded
server # [    2.904004] systemd[1]: Finished Load Kernel Modules.
server # [    2.904732] audit: type=1130 audit(1610617884.091:2): pid=1 uid=0 auid=4294967295 ses=4294967295 subj=kernel msg='unit=systemd-modules-load comm="systemd" exe="/nix/store/4i7s80g57bqha7nna9yqcr50my0fva80-systemd-247.2/lib/systemd/systemd" hostname=? addr=? terminal=? res=success'
server # [    2.907604] systemd[1]: Starting Firewall...
server # [    2.910402] systemd[1]: Starting Apply Kernel Variables...
server # [    2.943838] audit: type=1325 audit(1610617884.130:3): table=filter family=2 entries=0
server # [    2.946525] systemd[1]: Finished Apply Kernel Variables.
server # [    2.947327] audit: type=1130 audit(1610617884.134:4): pid=1 uid=0 auid=4294967295 ses=4294967295 subj=kernel msg='unit=systemd-sysctl comm="systemd" exe="/nix/store/4i7s80g57bqha7nna9yqcr50my0fva80-systemd-247.2/lib/systemd/systemd" hostname=? addr=? terminal=? res=success'
server # [    2.966638] systemd[1]: Finished Coldplug All udev Devices.
server # [    2.967732] audit: type=1130 audit(1610617884.155:5): pid=1 uid=0 auid=4294967295 ses=4294967295 subj=kernel msg='unit=systemd-udev-trigger comm="systemd" exe="/nix/store/4i7s80g57bqha7nna9yqcr50my0fva80-systemd-247.2/lib/systemd/systemd" hostname=? addr=? terminal=? res=success'
server # [    2.970283] systemd[1]: Starting Wait for udev To Complete Device Initialization...
server # [    2.983329] audit: type=1325 audit(1610617884.170:6): table=filter family=10 entries=0
server # [    3.050019] systemd[1]: Started Rule-based Manager for Device Events and Files.
server # [    3.050963] audit: type=1130 audit(1610617884.238:7): pid=1 uid=0 auid=4294967295 ses=4294967295 subj=kernel msg='unit=systemd-udevd comm="systemd" exe="/nix/store/4i7s80g57bqha7nna9yqcr50my0fva80-systemd-247.2/lib/systemd/systemd" hostname=? addr=? terminal=? res=success'
server # [    3.068194] audit: type=1325 audit(1610617884.255:8): table=filter family=2 entries=4
server # [    3.074846] audit: type=1325 audit(1610617884.262:9): table=filter family=10 entries=4
server # [    3.080941] audit: type=1325 audit(1610617884.268:10): table=filter family=2 entries=6
server # [    3.125272] systemd[1]: Started Journal Service.
server # [    3.129930] systemd-modules-load[446]: Inserted module 'bridge'
server # [    3.140316] systemd-modules-load[446]: Inserted module 'macvlan'
server # [    3.148707] systemd-modules-load[446]: Inserted module 'tap'
server # [    3.170332] systemd-modules-load[446]: Inserted module 'tun'
server # [    3.176941] systemd-modules-load[446]: Inserted module 'loop'
server # [    3.184650] systemd-sysctl[455]: Not setting net/ipv4/conf/all/rp_filter (explicit setting exists).
server # [    3.199802] systemd-sysctl[455]: Not setting net/ipv4/conf/default/rp_filter (explicit setting exists).
server # [    3.204299] systemd-sysctl[455]: Not setting net/ipv4/conf/all/accept_source_route (explicit setting exists).
server # [    3.206729] systemd-sysctl[455]: Not setting net/ipv4/conf/default/accept_source_route (explicit setting exists).
server # [    3.210992] systemd-sysctl[455]: Not setting net/ipv4/conf/all/promote_secondaries (explicit setting exists).
server # [    3.217847] systemd-sysctl[455]: Not setting net/ipv4/conf/default/promote_secondaries (explicit setting exists).
server # [    3.222622] systemd-udevd[453]: Network interface NamePolicy= disabled on kernel command line, ignoring.
server # [    3.225772] systemd[1]: Starting Flush Journal to Persistent Storage...
server # [    3.229060] systemd[1]: Finished Flush Journal to Persistent Storage.
server # [    3.233733] systemd[1]: Starting Create Volatile Files and Directories...
server # [    3.239040] systemd[1]: Finished Create Volatile Files and Directories.
server # [    3.244353] systemd[1]: Starting Rebuild Journal Catalog...
server # [    3.248913] systemd[1]: Starting Update UTMP about System Boot/Shutdown...
server # [    3.254066] systemd[1]: Finished Update UTMP about System Boot/Shutdown.
server # [    3.258053] systemd[1]: Finished Rebuild Journal Catalog.
server # [    3.262837] systemd[1]: Starting Update is Completed...
server # [    3.266530] systemd[1]: Finished Update is Completed.
server # [    3.382453] input: Power Button as /devices/LNXSYSTM:00/LNXPWRBN:00/input/input3
server # [    3.383307] ACPI: Power Button [PWRF]
server # [    3.445061] parport_pc 00:03: reported by Plug and Play ACPI
server # [    3.452509] parport0: PC-style at 0x378, irq 7 [PCSPP(,...)]
server # [    3.467879] Floppy drive(s): fd0 is 2.88M AMI BIOS
server # [    3.481006] FDC 0 is a S82078B
server # [    3.516989] Linux agpgart interface v0.103
server # [    3.501478] systemd-udevd[481]: Using default interface naming scheme 'v247'.
server # [    3.509865] systemd-udevd[481]: ethtool: autonegotiation is unset or enabled, the speed and duplex are not writable.
server # [    3.578130] SELinux: unrecognized netlink message: protocol=0 nlmsg_type=108 sclass=netlink_route_socket pid=481 comm=systemd-udevd
server # [    3.538660] systemd[1]: Finished Firewall.
server # [    3.544037] systemd-udevd[486]: Using default interface naming scheme 'v247'.
server # [    3.548606] systemd-udevd[486]: ethtool: autonegotiation is unset or enabled, the speed and duplex are not writable.
server # [    3.616768] piix4_smbus 0000:00:01.3: SMBus Host Controller at 0x700, revision 0
server # [    3.634639] mousedev: PS/2 mouse device common for all mice
server # [    3.599469] systemd[1]: Found device /dev/ttyS0.
server # [    3.728812] cryptd: max_cpu_qlen set to 1000
server # [    3.667309] systemd[1]: Found device Virtio network device.
server # [    3.780482] AVX2 version of gcm_enc/dec engaged.
server # [    3.780959] AES CTR mode by8 optimization enabled
server # [    3.717680] systemd[1]: Found device /dev/hvc0.
server # [    3.720122] systemd-udevd[480]: ethtool: autonegotiation is unset or enabled, the speed and duplex are not writable.
server # [    3.878357] ppdev: user-space parallel port driver
server # [    3.866408] udevadm[463]: systemd-udev-settle.service is deprecated. Please fix dhcpcd.service not to pull it in.
server # [    3.944686] bochs-drm 0000:00:02.0: remove_conflicting_pci_framebuffers: bar 0: 0xfd000000 -> 0xfdffffff
server # [    3.945680] bochs-drm 0000:00:02.0: remove_conflicting_pci_framebuffers: bar 2: 0xfebd0000 -> 0xfebd0fff
server # [    3.949560] bochs-drm 0000:00:02.0: vgaarb: deactivate vga console
server # [    3.970586] Console: switching to colour dummy device 80x25
server # [    3.975441] [drm] Found bochs VGA, ID 0xb0c0.
server # [    3.975918] [drm] Framebuffer size 16384 kB @ 0xfd000000, mmio @ 0xfebd0000.
server # [    3.980774] [TTM] Zone  kernel: Available graphics memory: 183142 KiB
server # [    3.981382] [TTM] Initializing pool allocator
server # [    3.981980] [TTM] Initializing DMA pool allocator
server # [    3.984537] [drm] Found EDID data blob.
server # [    3.988624] [drm] Initialized bochs-drm 1.0.0 20130925 for 0000:00:02.0 on minor 0
server # [    3.993098] fbcon: bochs-drmdrmfb (fb0) is primary device
server # [    3.997585] Console: switching to colour frame buffer device 128x48
server # [    4.001819] bochs-drm 0000:00:02.0: fb0: bochs-drmdrmfb frame buffer device
server # [    4.056648] intel_pmc_core intel_pmc_core.0:  initialized
server # [    4.130522] systemd[1]: Finished Wait for udev To Complete Device Initialization.
server # [    4.131685] systemd[1]: Reached target System Initialization.
server # [    4.132986] systemd[1]: Started Daily Cleanup of Temporary Directories.
server # [    4.136516] systemd[1]: Reached target Timers.
server # [    4.138900] systemd[1]: Listening on D-Bus System Message Bus Socket.
server # [    4.148645] systemd[1]: Listening on Nix Daemon Socket.connecting to host...
server #
server # [    4.160790] systemd[1]: Reached target Sockets.
server # [    4.170087] dhcpcd[620]: dev: loaded udev
server # [    4.184830] [    4.250846] 8021q: 802.1Q VLAN Support v1.8
server # systemd[1]: Reached target Basic System.
server # [    4.260033] proc: Bad value for 'hidepid'
server # [    4.198267] 45nk9ncjx5gsa31hpiifzbb64j04229m-audit-disable[622]: No rules
server # [    4.203732] nscd[628]: 628 monitoring file `/etc/passwd` (1)
server: connected to guest root shell
server # [    4.214625] systemd[1]: Starting Kernel Auditing...
server: (connecting took 4.88 seconds)
server # [    4.221917] nscd[628]: 628 monitoring directory `/etc` (2)
(4.90 seconds)
server # sh: cannot set terminal process group (-1): Inappropriate ioctl for device
server # sh: no job control in this shell
server # [    4.230614] systemd[1]: Started backdoor.service.
server # [    4.237593] nscd[628]: 628 monitoring file `/etc/group` (3)
server # [    4.245415] systemd[1]: Starting DHCP Client...
server # [    4.246203] nscd[628]: 628 monitoring directory `/etc` (2)
server # [    4.256315] systemd[1]: Starting Name Service Cache Daemon...
server # [    4.257098] nscd[628]: 628 monitoring file `/etc/hosts` (4)
server # [    4.265613] systemd[1]: Starting resolvconf update...
server # [    4.270996] [    4.337642] input: ImExPS/2 Generic Explorer Mouse as /devices/platform/i8042/serio1/input/input4
server # nscd[628]: 628 monitoring directory `/etc` (2)
server # [    4.284950] systemd[1]: Finished Kernel Auditing.
server # [    4.292638] nscd[628]: 628 disabled inotify-based monitoring for file `/etc/resolv.conf': No such file or directory
server # [    4.300338] systemd[1]: Started Name Service Cache Daemon.
server # [    4.305040] nscd[628]: 628 stat failed for file `/etc/resolv.conf'; will try again later: No such file or directory
server # [    4.312121] systemd[1]: Reached target Host and Network Name Lookups.
server # [    4.317850] nscd[628]: 628 monitoring file `/etc/services` (5)
server # [    4.324305] systemd[1]: Reached target User and Group Name Lookups.
server # [    4.329138] nscd[628]: 628 monitoring directory `/etc` (2)
server # [    4.334520] systemd[1]: Starting User Login Management...
server # [    4.342042] nscd[628]: 628 disabled inotify-based monitoring for file `/etc/netgroup': No such file or directory
server # [    4.355932] systemd[1]: Listening on Load/Save RF Kill Switch Status /dev/rfkill Watch.
server # [    4.372912] nscd[628]: 628 stat failed for file `/etc/netgroup'; will try again later: No such file or directory
server # [    4.382765] systemd[1]: Stopping Name Service Cache Daemon...
server # [    4.396415] systemd-logind[643]: New seat seat0.
server # [    4.402835] systemd[1]: nscd.service: Succeeded.
server # [    4.408934] systemd[1]: Stopped Name Service Cache Daemon.
server # [    4.418952] systemd-logind[643]: Watching system buttons on /dev/input/event2 (Power Button)[    4.489932] cfg80211: Loading compiled-in X.509 certificates for regulatory database
server #
server # [    4.434302] nscd[684]: 684 monitoring file `/etc/passwd` (1)
server # [    4.435108] systemd-logind[643]: Watching system buttons on /dev/input/event0 (AT Translated Set 2 keyboard)
server # [    4.443725] nscd[684]: 684 monitoring directory `/etc` (2)
server # [    4.448589] systemd[1]: Started D-Bus System Message Bus.
server # [    4.451798] nscd[684]: 684 monitoring file `/etc/group` (3)
server # [    4.456866] systemd[1]: Starting Name Service Cache Daemon...
server # [    4.462634] dbus-daemon[678]: dbus[678]: Unknown username "systemd-timesync" in message bus configuration file
server # [    4.465018] nscd[684]: 684 monitoring directory `/etc` (2)
server # [    4.467167] systemd[1]: Finished resolvconf update.
server # [    4.469411] [    4.535304] cfg80211: Loaded X.509 cert 'sforshee: 00b28ddf47aef9cea7'
server # nscd[684]: 684 monitoring file `/etc/hosts` (4)
server # [    4.538376] platform regulatory.0: Direct firmware load for regulatory.db failed with error -2
server # [    4.539450] cfg80211: failed to load regulatory.db
server # [    4.479808] systemd[1]: Started Name Service Cache Daemon.
server # [    4.483160] nscd[684]: 684 monitoring directory `/etc` (2)
server # [    4.485069] systemd[1]: Reached target Network (Pre).
server # [    4.488162] nscd[684]: 684 monitoring file `/etc/resolv.conf` (5)
server # [    4.490426] systemd[1]: Reached target All Network Interfaces (deprecated).
server # [    4.492734] nscd[684]: 684 monitoring directory `/etc` (2)
server # [    4.496566] systemd[1]: Starting Address configuration of eth1...
server # [    4.500151] nscd[684]: 684 monitoring file `/etc/services` (6)
server # [    4.502681] nscd[684]: 684 monitoring directory `/etc` (2)
server # [    4.504510] nscd[684]: 684 disabled inotify-based monitoring for file `/etc/netgroup': No such file or directory
server # [    4.575054] 8021q: adding VLAN 0 to HW filter on device eth1
server # [    4.509149] nscd[684]: 684 stat failed for file `/etc/netgroup'; will try again later: No such file or directory
server # [    4.518730] network-addresses-eth1-start[697]: adding address 192.168.1.1/24... done
server # [    4.526464] dbus-daemon[678]: [system] Successfully activated service 'org.freedesktop.systemd1'
server # [    4.529118] systemd[1]: Started User Login Management.
server # [    4.601381] 8021q: adding VLAN 0 to HW filter on device eth0
server # [    4.538154] systemd[1]: Finished Address configuration of eth1.
server # [    4.540899] dhcpcd[620]: eth0: waiting for carrier
server # [    4.547558] systemd[1]: Starting Networking Setup...
server # [    4.551015] dhcpcd[620]: eth0: carrier acquired
server # [    4.552390] dhcpcd[620]: DUID 00:01:00:01:27:92:d0:9d:52:54:00:12:34:56
server # [    4.553764] dhcpcd[620]: eth0: IAID 00:12:34:56
server # [    4.556565] dhcpcd[620]: eth0: adding address fe80::5054:ff:fe12:3456
server # [    4.605845] systemd[1]: Finished Networking Setup.
server # [    4.607373] systemd[1]: Starting Extra networking commands....
server # [    4.614646] systemd[1]: Finished Extra networking commands..
server # [    4.616943] systemd[1]: Reached target Network.
server # [    4.618833] systemd[1]: Starting Permit User Sessions...
server # [    4.632976] systemd[1]: Finished Permit User Sessions.
server # [    4.634655] systemd[1]: Started Getty on tty1.
server # [    4.635470] systemd[1]: Reached target Login Prompts.
server # [    5.182722] dhcpcd[620]: eth0: soliciting an IPv6 router
server # [    5.455448] dhcpcd[620]: eth0: soliciting a DHCP lease
server # [    5.537098] NET: Registered protocol family 17
server # [    5.474219] dhcpcd[620]: eth0: offered 10.0.2.15 from 10.0.2.2
server # [    5.474991] dhcpcd[620]: eth0: leased 10.0.2.15 for 86400 seconds
server # [    5.475881] dhcpcd[620]: eth0: adding route to 10.0.2.0/24
server # [    5.477379] dhcpcd[620]: eth0: adding default route via 10.0.2.2
server # [    5.527440] nscd[684]: 684 monitored file `/etc/resolv.conf` was written to
server # [    5.540350] systemd[1]: Stopping Name Service Cache Daemon...
server # [    5.542743] systemd[1]: nscd.service: Succeeded.
server # [    5.543718] systemd[1]: Stopped Name Service Cache Daemon.
server # [    5.546472] systemd[1]: Starting Name Service Cache Daemon...
server # [    5.556798] nscd[804]: 804 monitoring file `/etc/passwd` (1)
server # [    5.557975] nscd[804]: 804 monitoring directory `/etc` (2)
server # [    5.559807] nscd[804]: 804 monitoring file `/etc/group` (3)
server # [    5.564721] nscd[804]: 804 monitoring directory `/etc` (2)
server # [    5.565858] systemd[1]: Started Name Service Cache Daemon.
server # [    5.567992] nscd[804]: 804 monitoring file `/etc/hosts` (4)
server # [    5.569545] nscd[804]: 804 monitoring directory `/etc` (2)
server # [    5.571009] nscd[804]: 804 monitoring file `/etc/resolv.conf` (5)
server # [    5.572515] nscd[804]: 804 monitoring directory `/etc` (2)
server # [    5.574071] nscd[804]: 804 monitoring file `/etc/services` (6)
server # [    5.576307] nscd[804]: 804 monitoring directory `/etc` (2)
server # [    5.578208] nscd[804]: 804 disabled inotify-based monitoring for file `/etc/netgroup': No such file or directory
server # [    5.579972] nscd[804]: 804 stat failed for file `/etc/netgroup'; will try again later: No such file or directory
server # [    5.592145] dhcpcd[821]: Failed to reload-or-try-restart ntpd.service: Unit ntpd.service not found.
server # [    5.593202] dhcpcd[821]: Failed to reload-or-try-restart openntpd.service: Unit openntpd.service not found.
server # [    5.594540] dhcpcd[821]: Failed to reload-or-try-restart chronyd.service: Unit chronyd.service not found.
server # [    5.601137] dhcpcd[620]: forked to background, child pid 822
server # [    5.602817] systemd[1]: Started DHCP Client.
server # [    5.604577] systemd[1]: Reached target Network is Online.
server # [    5.606829] systemd[1]: Reached target Multi-User System.
server # [    5.607998] systemd[1]: Startup finished in 2.298s (kernel) + 3.301s (userspace) = 5.600s.
server # [    6.451541] dhcpcd[822]: eth0: Router Advertisement from fe80::2
server # [    6.453734] dhcpcd[822]: eth0: adding address fec0::5054:ff:fe12:3456/64
server # [    6.454526] dhcpcd[822]: eth0: adding route to fec0::/64
server # [    6.455184] dhcpcd[822]: eth0: adding default route via fe80::2
error:
Traceback (most recent call last):
  File "/nix/store/pghswfpz2ygfa84i9j77g2669mz9cmkr-nixos-test-driver/bin/.nixos-test-driver-wrapped", line 897, in run_tests
    exec(tests, globals())
  File "<string>", line 1, in <module>
  File "<string>", line 4, in <module>
AssertionError
cleaning up
killing server (pid 9)
(0.00 seconds)
builder for '/nix/store/gryk96pn81hp6w6fbj9vihsac4fqb4xa-vm-test-run-minimal_test_failing.drv' failed with exit code 1
error: build of '/nix/store/gryk96pn81hp6w6fbj9vihsac4fqb4xa-vm-test-run-minimal_test_failing.drv' failed
#+end_example
